############### Notes ###############################
# Installing a Brewfile
# brew bundle --file=~/Development/config/Brewfile 
# 
# Creating a Brewfile into current directory
# brew bundle dump
# 
# Overwrite Brewfile 
# brew bundle dump --force
######### Brewfile Starts Here ######################
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
# brew install
brew "fish"
brew "starship"
brew "ripgrep"
brew "sqlite"
# https://github.com/universal-ctags/ctags
brew "ctags"                
brew "libevent"
brew "git"
# Includes clang for c++
brew "llvm"
brew "node"
brew "pyenv"
brew "redis", restart_service: true
brew "subversion"
brew "tmux"
brew "vips"
# Neovim dependencies
brew "ninja"
brew "libtool"
brew "automake"
brew "cmake"
brew "pkg-config"
brew "gettext"
brew "curl"
# brew install --cask
cask "alacritty"
