############### Notes ###############################
# Installing a Brewfile
# brew bundle --file=~/Development/config/Brewfile 
# 
# Creating a Brewfile into current directory
# brew bundle dump
# 
# Overwrite Brewfile 
# brew bundle dump --force
######### Brewfile Starts Here ######################
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
# brew install
brew "fish" # favorite shell
brew "starship" # shell prompt
brew "sqlite"
# https://github.com/universal-ctags/ctags
brew "ctags"                
brew "libevent"
brew "git" # self-explanatory
# Helpful CLI
brew "fzf" # fuzzy finder
brew "exa" # ls replacement
brew "bat" # cat replacement
brew "fd" # find replacement
brew "ripgrep" # grep replacement
brew "tldr" # simplified man pages
# Includes clang for c++
brew "llvm"
brew "node" # js runtime
brew "pyenv" # python version management
brew "redis", restart_service: true # cache
brew "subversion"
brew "tmux" # terminal multiplexer
brew "vips"
# Neovim dependencies
brew "ninja"
brew "libtool"
brew "automake"
brew "cmake"
brew "pkg-config"
brew "gettext"
brew "curl"
# brew install --cask
cask "alacritty" # terminal
